Hi @eddiezane ,
thank you for your comment. I tried with 1.10.0 but the same error keeps happening - here's the log:
```
petar@petar-XPS-15-9550:~/workspace/nemesis-cloud-ami/hotel(master)$ terraform init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "digitalocean" (terraform-providers/digitalocean) 1.10.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
petar@petar-XPS-15-9550:~/workspace/nemesis-cloud-ami/hotel(master)$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet.nemesis-docker will be created
  + resource "digitalocean_droplet" "nemesis-docker" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "54459222"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "123"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "ams2"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + ssh_keys             = [
          + "4d:ec:01:37:e4:a6:f0:55:e2:13:08:c0:9b:77:85:f8",
          + "f8:4c:bc:91:d5:74:1a:2c:f0:9f:78:e7:fa:cc:a8:a5",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

digitalocean_droplet.nemesis-docker: Creating...

Error: Error creating droplet: POST https://api.digitalocean.com/v2/droplets: 422 f8:4c:bc:91:d5:74:1a:2c:f0:9f:78:e7:fa:cc:a8:a5 are invalid key identifiers for Droplet creation.

  on digitalocean.tf line 7, in resource "digitalocean_droplet" "nemesis-docker":
   7: resource "digitalocean_droplet" "nemesis-docker" {


petar@petar-XPS-15-9550:~/workspace/nemesis-cloud-ami/hotel(master)$ 

```
I'm not sure if it is important but I export my variables as environment variables like this:
```
export TF_VAR_ssh_fingerprints='["4d:ec:01:37:e4:a6:f0:55:e2:13:08:c0:9b:77:85:f8","f8:4c:bc:91:d5:74:1a:2c:f0:9f:78:e7:fa:cc:a8:a5"]'
```
and then I run `terraform apply`